let fruit_chaewon = ["복숭아","샤인머스캣","사과","포도","멜론","수박"]
let fruit_minjae = ["귤","블루베리","아보카도","딸기","참외"]
let fruit_gieun = ["사과","복숭아","오렌지","배"]
let fruit_hangyeol =["멜론","사과","감","바나나","딸기","참외"]
let fruit_hanjihyun =["망고","딸기","멜론","블루베리","복숭아","키위"]
let fruit_songjihyun =["멜론","망고","블루베리","천혜향"]
let fruit_minyoung =["파인애플","사과","바나나","귤"]
let fruit_suji =["사과","자몽","오렌지","귤","레몬","용과","블루베리","레드향"]
let fruit_kyungmin = ["망고","거봉","감","홍시","파인애플"]
let fruit_junghyunjin =["수박","참외","오렌지","파인애플","복숭아","멜론","바나나","키위","딸기"]

console.log(fruit_chaewon[1])
console.log(fruit_chaewon.length)
console.log(fruit_minjae[2])
console.log(fruit_minjae.length)
// 배열의 갯수를 새는 length 함수는 1부터 센다.

let green8th = [
    ["정현진","남자",50,false,["파인애플","멜론"]],
    ["김경민","여자",30,false,["망고","거봉","감","홍시","파인애플"]],
    ["왕민재","남자",24,false,["귤","블루베리","아보카도","딸기","참외"]],
    ["이채원","여자",25,false,["복숭아","샤인머스캣","사과","포도","멜론","수박"]],
    ["한기은","여자",28,false,["사과","복숭아","오렌지","배"]],
    ["김한결","여자",25,false,["멜론","사과","감","바나나","딸기","참외"]],
    ["정민영","여자",25,false,["파인애플","사과","바나나","귤"]],
    ["한지현","여자",30,false,["망고","딸기","멜론","블루베리","복숭아","키위"]],
    ["송지현","여자",32,false,["멜론","망고","블루베리","천혜향"]],
    ["이수지","여자",26,false,["사과","자몽","오렌지","귤","레몬","용과","블루베리","레드향"]]
]

let person1 = ["정현진","남자",50,false,["파인애플","멜론"]];

let person2 = ["김경민","여자",30,false,["망고","거봉","감","홍시","파인애플"]]

// ["왕민재","남자",24,false,["귤","블루베리","아보카도","딸기","참외"]]

console.log(person1[0]) // 정현진
console.log(person2[4][3]) // 홍시
console.log(green8th)
console.log(green8th[0])


