$(document).ready(function(){

    let news =[
        `조국 조국혁신당 대표가 '채상병 특검법'에 여당에서 김웅, 안철수, 유의동 의원이 공개 찬성 의사를 밝힌 것과 관련해 "세 분 정도 더 추가될 것"이라고 의견을 밝혔다.

        24일 MBC 라디오 '김종배의 시선집중'에서 조국 대표는 "제가 들은 바로는 세 분 정도가 '이건 아니지 않느냐'라는 생각을 하고 있는 것 같다"라며 "이 분들은 낙천 또는 낙선된 분들인데 본인이 다음에 정치권으로 복귀하려면 내후년 재보궐 선거나 4년 뒤 총선"이라고 설명했다.
        
        그러면서 "그때는 윤석열 정권의 힘이 완전히 빠졌거나 윤석열 정권이 종료된 뒤 아니겠냐. 2년 뒤 또는 4년 뒤를 생각하면서 찬성해야 되지 않나 하는 분이 김웅·안철수·유의동 말고 한 세 분 정도 더 있다고 알고 있다"고 말했다.
        
        이어 조 대표는 김웅, 안철수, 유의동 의원 말고도 '채상병 특검법'에 추가로 찬성표를 던지는 게 확인이 되면 "(당에) 균열이 생기는 것"이라고 관측했다.
        
        조 대표는 김건희 여사의 공개 활동에 재개에 대해서는 "자신만만한 모습을 보여준 것"이라며 비판했다.
        
        그는 "150여 일을 침묵 하시다가 서울중앙지검 인사를 하자 바로 그 다음날 등장한 거 아니냐"며 "나를 이제 못 건드릴 것이다의 모습을 보여준 것"이라고 지적했다.
        
        아울러 한동훈 전 국민의힘 비상대책위원장의 전당대회 출마설과 관련해선 출마에 무게를 실었다.
        
        조국 대표는 "공공도서관에서 언론에 노출되도록 책을 읽은 것은 다시 조명 받고 다시 또 정치 무대로 복귀하겠다는 의사 표시"라고 설명했다.`,
        
        `23일 국토부·법무부·금융위 주최 종합토론회 개최

        야당의 주도로 국회 본회의에 직회부된 전세사기 특별법 개정안에 대해 관계 기관과 업계 전문가들이 실질적인 피해자 구제가 어려울 수 있다고 지적했다. 이대로 통과돼 시행이 된다고 하더라도 주택도시보증공사(HUG)의 업무 수행 인력과 예산 문제, 헌법 등과의 제도적 충돌 등이 우려된다는 것이다.
        
        23일 서울 서초구 서초동 한국부동산원 서울 강남지사에서 열린 전세사기 특별법 개정안 토론회에서 최우석 HUG 전세피해지원기획팀장이 발표하고 있다. /백윤미 기자
        23일 서울 서초구 서초동 한국부동산원 서울 강남지사에서 열린 전세사기 특별법 개정안 토론회에서 최우석 HUG 전세피해지원기획팀장이 발표하고 있다. /백윤미 기자
        
        국토교통부와 법무부, 금융위원회는 23일 서울 서초구 서초동 한국부동산원 서울 강남지사에서 ‘전세사기 특별법’ 개정안에 대한 종합 토론회를 개최했다.
        
        첫 번째로 최우석 HUG 전세피해지원기획팀장은 전세사기 특별법 개정안에 따른 HUG의 역할과 문제점에 대해 발표했다. HUG는 ▲임차보증금 반환채권의 매입 신청·접수 ▲임차보증금 반환채권 매입기관 ▲임차보증금 반환채권 가치평가 투입비용 환수 등의 역할을 하고 있다.
        
        최 팀장은 개정안 시행 시 발생할 수 있는 문제점에 대해서는 HUG의 업무 수행 인력 및 예산을 꼽았다. HUG는 유일하게 임차보증금 반환채권을 매입하는 기관으로서, 고유 업무인 보증발급 및 대위변제 급증에 따른 인력과 예산이 부족하다는 점을 지적했다. 선구제 후회수 업무 수행 시 운용 비용으로 1000억원~3000억원 추가 소요가 예상된다는 것이다.
        
        그밖에 임차보증금 반환채권 가치평가가 경매 낙찰가율이 지역별, 용도별, 시장상황별, 회수시기별 큰 폭의 변동성을 보여서 추세를 확인하기 어렵다는 점도 꼽았다. 이어 타 사기 피해자와의 형평성 문제의 제기가 우려된다는 점도 언급했다.
        
        두 번째 발표를 맡은 박종인 한국토지주택공사(LH) 매입임대사업처 팀장은 전세사기 피해자 주거 지원 방안에 대해 ▲피해주택 매입 ▲대체 공공임대주택 우선 공급 ▲긴급주거지원 등을 제시했다. 피해 주택 매입 방법에 있어서도 기존 경·공매 방식에 더해 임대인과 임차인의 합의를 통해 피해 주택을 매입하는 협의매수 방식을 병행할 것이라고 밝혔다.
        
        또 최대 20년 거주 가능한 대체공공임대주택과 최대 2년 거주 가능한 긴급주거지원 방안과 관련해서도 언급했다. 이어 향후 피해주택 인근 선호도가 높은 매입임대주택을 공급하며 사각지대를 해소하겠다고 밝혔다. LH는 올해부터 내년까지 신축 매입임대 7만6000가구 매입을 추진하고 있다. 또 보증금과 월임대료를 전환하는 등 피해자의 주거비 부담을 완화할 수 있는 방안도 검토하겠다고 했다.`,
        `이미 이혼했더라도 특별한 사정이 있으면 혼인을 무효로 할 수 있다는 대법원판결이 나왔다. 이미 이혼한 부부의 혼인을 무효로 돌릴 법률상 이익이 없다는 기존 대법원 판례가 40년 만에 깨졌다.

        대법원 전원합의체는 23일 A씨가 전 남편 B씨를 상대로 낸 혼인 무효 청구 소송에서 원심의 각하 판결을 파기하고 사건을 서울가정법원으로 돌려보냈다.
        
        대법원은 "혼인 관계를 전제로 수많은 법률관계가 형성돼, 그 자체의 무효 확인을 구하는 것이 관련된 분쟁을 한꺼번에 해결하는 유효·적절한 수단일 수 있다"며 "이혼으로 혼인 관계가 이미 해소된 이후라고 하더라도 혼인 무효의 확인을 구할 이익이 인정된다"고 밝혔다.
        
        A씨는 2001년 B씨와 결혼했다가 2004년 이혼했는데, 혼인신고 당시 의사를 결정할 수 없는 정신 상태에서 실질적 합의 없이 혼인신고를 했다며 혼인을 무효로 해달라고 청구했다.
        
        민법 815조는 당사자 간에 혼인의 합의가 없었거나 근친혼일 경우 혼인을 무효로 할 수 있다고 정한다.
        
        그러나 1984년 나온 대법원의 기존 판례는 이미 이혼한 부부의 혼인은 사후에 무효로 돌릴 수 없다는 입장을 유지해왔다. 이미 혼인 관계가 해소됐으므로 실익이 없다는 이유에서다.
        
        당시 판례는 "단순히 여성이 혼인했다가 이혼한 것처럼 호적상 기재되어 있어 불명예스럽다는 사유만으로는 (혼인 무효) 확인의 이익이 없다"고 했다.`,
        
        `지난해 3월 카카오톡 오픈채팅방 참여자들의 개인정보가 유출됐다는 의혹을 조사한 개인정보보호위원회가 카카오톡에 151억4196만원의 과징금을 부과했다. 국내 기업을 상대로 부과한 조치로는 역대 최대 규모다. 제재를 한층 강화한 개정 개인정보법이 적용된 골프존(기존 국내 최다 과징금 건)도 75억원의 과징금을 받는 데 그쳤는데 카카오는 상대적으로 제재가 약한 구법을 적용했음에도 그 2배가 넘는 과징금이 매겨졌다.

        23일 개인정보위에 따르면 카카오 오픈채팅 시스템의 보안 취약점으로 인해 최소 6만5000여명의 개인정보가 유출됐을 것으로 추정됐다. 개인정보위는 또 지난해 3월 오픈채팅 개인정보 유출 의혹이 제기된 이후 카카오가 개인정보 유출신고를 하지 않은 점을 또 문제 삼아 역대 최대 규모의 과징금을 부과하기에 이르렀다.
        
        진통도 컸다. 개인정보위와 카카오가 '개인정보 유출' 여부에 대해 완전히 상이한 판단을 내렸기 때문이다. 이번 카카오 문제를 심의하기 위한 전체회의 시간만 4시간이 소요됐다. 통상 2시간이 안되는 시간에 여러 안건을 처리하는 것과 달리 카카오와 개인정보위 사이의 공방도 치열했다고 전해졌다.`,
        `국이 오는 7월 4일 차기 정부를 결정하는 조기 총선을 치르기로 했다. 여러 정황상 14년 만에 보수당에서 노동당으로 정권교체가 이뤄질 가능성이 높다. 20%대 역대 최저 지지율로 고전하고 있는 리시 수낵 총리가 경제 성과를 앞세워 '정치적 도박'을 시도했다는 분석이 나온다.

        수낵 총리는 22일(현지시간) 런던 다우닝가 10번지 총리 관저 앞에서 깜짝 연설을 하면서 "영국이 미래를 선택할 순간"이라며 "7월 4일 총선을 치를 계획"이라고 발표했다. 이날 수낵 총리는 찰스 3세 국왕을 만나 차기 총선을 위한 의회 해산을 요청했다.
        
        영국의 다음 총선은 내년 1월 28일까지만 치러지면 되며, 총리가 조기 총선을 선택할 수 있다. 앞서 영국 정가에서는 보수당의 낮은 지지율 반등을 기대하면서 10월 이후 연말에나 선거가 치러질 것으로 전망해왔다.
        
        2019년 12월 치러진 지난 총선에서는 보리스 존슨 당시 총리가 이끌었던 여권 보수당이 하원 총 650석 중 365석의 과반을 차지했다. 당시 브렉시트(영국의 유럽연합(EU) 탈퇴)로 인한 혼란 속에서 국민들이 안정을 택했다는 분석이 나왔다.
        
        영국 보수당은 2010년부터 데이비드 캐머런(2010~2016년), 테리사 메이(2016~2019년), 보리스 존슨(2019~2022년), 리즈 트러스(2022년), 수낵 총리(2022~2024년)까지 14년을 집권해왔다.
        
        수낵 총리는 이날 연설에서 "우리가 힘겹게 얻어낸 경제적 안정을 위험에 빠뜨리지 않을 수 있는 건 내가 이끄는 보수당 정부뿐"이라며 "내가 할 수 있는 가장 강력한 보호를 여러분께 제공하는 데 전력을 다할 것"이라고 말했다. 이어 "우리가 해낸 성취, 대담한 행동이 자랑스럽고 장래에 우리가 할 수 있는 일에 자신감이 있다"며 "이제 문제는 여러분이 가족과 나라의 안전한 미래를 위해 누굴 믿느냐다"고 강조했다. 코로나19 팬데믹과 러시아의 우크라이나 침공으로 촉발된 경제와 안보 위기가 차츰 회복세를 보이면서 보수당 정부의 성과를 강조하겠다는 취지다.
        `,
    ]

    $(".list>li").click(function(){
        $(".list>li").removeClass("on")
        $(this).addClass("on")

        // index함수는 선택한 태그의 부모태그기준 순번을 리턴한다.
        // 리턴된 순번은 숫자데이터이며 idx변수에 저장된다.
        // news라는 배열에 idx순번에 맞는 원소가 box_news클래스의 새로운 내용으로 들어간다
        let idx = $(this).index()
        $(".box_news").html(news[idx])
    })



})